# ===================================================================
#                      字段提取配置文件
# ===================================================================

# --- 目录配置 (Directory Configuration) ---

# 请将此路径替换为您存放所有待处理图片的文件夹路径。
# 例如: "C:/Users/YourUser/Desktop/RunningImages"
IMAGE_DIRECTORY = r'C:\Computer\my_github\github_cpp\workout_heat\run_pics'

# 请指定一个用于存放输出的 JSON 文件的文件夹路径。
# 如果该文件夹不存在，程序会自动创建。
JSON_OUTPUT_DIRECTORY = 'workout_json'


# ===================================================================
# 'name': 将是最终JSON文件中的键名 (key)。
# 'box':  是您使用图像编辑工具测量的 (left, top, right, bottom) 坐标。
#
# 要添加新字段，只需复制一个字典块并修改其中的值即可。
# ===================================================================

FIELDS = [
    {
        "name": "start_time",
        "box": (69, 679, 565, 731) # 运动开始的时间
    },
    {
        "name": "sport_type",
        "box": (63, 551, 461, 655) # 运动类型,例如室内跑步
    },
    {
        "name": "data_source",
        "box": (83, 851, 353, 913) # 数据来源
    },
    {
        "name": "mileage", 
        "box": (91, 943, 357, 1077) # 运动里程
    },
    {
        "name": "time", 
        "box": (81, 1231, 349, 1309) # “运动时长”提供的新坐标
    },
    {
         "name": "BPM", 
         "box": (781, 1431, 951, 1517) # 您为“平均心率”提供的新坐标
    },
    {
        "name": "active_calories", 
        "box": (464, 1240, 565, 1292) # 运动消耗卡路里
    },
    {
        "name": "total_calories", 
        "box": (801, 1231, 913, 1292) # 静息消耗+运动消耗的卡路里
    },
    {
        "name": "max_BPM", 
        "box": (797, 1861, 957, 1939) # 最大心率
    }
]